tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/science"

# Tools
brew "git", args: ["HEAD", "with-curl", "with-openssl"]
brew "coreutils"
brew "ack"
brew "grep"
brew "gnu-tar"
brew "watch"
brew "curl"
brew "jq"
brew "p7zip"

# Languages
brew "python"
brew "python@2"
brew "ruby"
brew "go"

# Editors
brew "emacs"
brew "vim"

# Shells
brew "bash"
brew "fish"
brew "zsh"

# Fonts
cask "font-source-code-pro"
cask "font-ibm-plex"

# Applications
cask "google-chrome"
cask "virtualbox"
cask "visual-studio-code"
cask "zerotier-one"